# GetHashCode Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ElementId..::..GetHashCode Method
ElementId Class See Also
---
Gets the integer value of the id as hash code
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public override int GetHashCode()
```

Visual Basic
---
```text
Public Overrides Function GetHashCode As Integer
```

Visual C++
---
```text
public:
virtual int GetHashCode() override
```

# See Also
ElementId Class
Autodesk.Revit.DB Namespace